proprietary-recommendations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Open Source Open Science</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/terminal.css" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orge7eb2fa" class="outline-2">
<h2 id="orge7eb2fa">Proprietary Recommendations</h2>
<div class="outline-text-2" id="text-orge7eb2fa">
<ul class="org-ul">
<li>Almost impossible not to use at least some proprietary software.</li>
<li>Be wary of high switching costs.</li>
<li>Avoid proprietary file formats and exchange protocols whenever possible.</li>
<li>Keep copies of your data in your control.</li>
<li>Consider diverse collaborators across long ranges of space and time.</li>
<li>Discover alternatives so you always have a way out if necessary.</li>
<li>If a platform gets too shitty, pay the switching costs and move!</li>
</ul>


<p>
<a href="./index.html">Home</a> <a href="./xkcd.html">Previous</a> <a href="./user-advantages.html">Next</a>
</p>
</div>
</div>
</div>
</body>
</html>
